XMegaForArduino/arduino/variants/RockSolid128A/pins_arduino.h
// serial port 2
#define SERIAL_2_PORT_NAME PORTE
#define SERIAL_2_USART_NAME USARTE1
#define SERIAL_2_USART_DATA USARTE1_DATA
#define SERIAL_2_RXC_ISR ISR(USARTE1_RXC_vect)
#define SERIAL_2_DRE_ISR ISR(USARTE1_DRE_vect)
#define SERIAL_2_RX_PIN_INDEX 6 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_2_TX_PIN_INDEX 7 /* the pin number on the port, not the mapped digital pin number */
#define USARTE1_VECTOR_EXISTS

// serial port 3
#define SERIAL_3_PORT_NAME PORTF
#define SERIAL_3_USART_NAME USARTF0
#define SERIAL_3_USART_DATA USARTF0_DATA
#define SERIAL_3_RXC_ISR ISR(USARTF0_RXC_vect)
#define SERIAL_3_DRE_ISR ISR(USARTF0_DRE_vect)
#define SERIAL_3_RX_PIN_INDEX 2 /* the pin number on the port, not the mapped digital pin number */
#define SERIAL_3_TX_PIN_INDEX 3 /* the pin number on the port, not the mapped digital pin number */
#define USARTF0_VECTOR_EXISTS



// For atmega/Arduino shield compatibility, with DIGITAL_IO_PIN_SHIFT defined
// typical board/pin layout might be like this (for shield pins):
//

// NOTE:  re-do this ASCII art for the MEGA2560 layout


//      
//                                                                 R I
//                                                                 E O N
//                    A A A A A A                        V G G 3   S R .
//                    1 1 1 1 1 1 A A   A A A A A A A A  I N N V 5 E E C
//                    5 4 3 2 1 0 9 8   7 6 5 4 3 2 1 0  n D D 3 V T F .
//              {  } -o-o-o-o-o-o-o-o---o-o-o-o-o-o-o-o--o-o-o-o-o-o-o-o-----------
//                    P P P P P P P P   P P P P P P P P
//  PF0 55 -o-o PF1   B B B B B B B B   A A A A A A A A
//  PF4 53 -o-o PF7   7 6 5 4 3 2 1 0   7 6 5 4 3 2 1 0
//  PF5 51 -o-o PF6                                                 EXTRA-CONNECTOR
//  PC0 49 -o-o 48 PC1                                                 56 -o- PQ0
//  PD6 47 -o-o 46 PD7                                                 57 -o- PQ1
//  PH4 45 -o-o 44 PH5                                                 58 -o- PQ2 - ASYNC
//  PH6 43 -o-o 42 PH7                                                 59 -o- PQ3 - LED_DEFAULT
//  PH0 41 -o-o 40 PH1                                                 60 -o- PR0 - XTAL1
//  PH2 39 -o-o 38 PH3                                                 61 -o- PR1 - XTAL2
//  PK0 37 -o-o 36 PK1                 T O P   V I E W                    -o- GND
//  PK2 35 -o-o 34 PK3                                                    -o- N/C
//  PK4 33 -o-o 32 PJ5
//  PK6 31 -o-o 30 PK7
//  PJ7 29 -o-o 28 PJ6
//  PJ5 27 -o-o PJ4       P P P P P P P P   P P P P P P   P P P P P P P P
//  PJ3 25 -o-o PJ2       D D D D E E F F   C C E E E E   E E D D C C C C
//  PJ1 23 -o-o PJ0       1 0 2 3 6 7 2 3   2 3 5 4 3 2   1 0 5 4 4 5 6 7
//         -o-o {  } -----o-o-o-o-o-o-o-o---o-o-o-o-o-o---o-o-o-o-o-o-o-o-o-o-o-o---
//          5 5           2 2 1 1 1 1 1 1                         1 1 1 1 G A S S
//          V V           1 0 9 8 7 6 5 4   0 1 2 3 4 5   6 7 8 9 0 1 2 3 N R C D
//                        S S R T R T R T   R T                   S M M S D E L A
//                        C D x x x x x x   x x                   S O I C   F
//                        L A 1 1 2 2 3 3   0 0                     S S K
//                                                                  I O


// As with other 'mega' Arduino boards, additional connectors would
// break out the additional pins, with appropriate labeling.
//
// This layout is based on the 'Rev 3' Arduino mega 2560
//
// NOTE - NO AREF:  AREF is not connected.  AREF is a bit of an issue on xmega because
// it DOES! NOT! WORK! THE! SAME! as it does on the ATmegaXXX and so you would need to
// (literally) steal one of the additional analog input pins to implement it. It's not
// impossible, or even THAT difficult.  I'm just not doing it here.



// default SPI
static const uint8_t SS   = 10;
static const uint8_t MOSI = 11;
static const uint8_t MISO = 12;
static const uint8_t SCK  = 13;

// primary SPI on PC4-7
static const uint8_t SS0   = 10;
static const uint8_t MOSI0 = 11;
static const uint8_t MISO0 = 12;
static const uint8_t SCK0  = 13;

// secondary SPI on PD4-7
static const uint8_t SS1   = 2;
static const uint8_t MOSI1 = 3;
static const uint8_t MISO1 = 4;
static const uint8_t SCK1  = 5;

// default 2-wire on PE0,PE1 - TWIE  (for TWIC, you're on your own)
// NOTE:  TWIE appears it may be broken, so switch to TWIC?
static const uint8_t SDA = 14;
static const uint8_t SCL = 15;

// TODO:  alternate 2-wire ports

// keep track of the indices for ports Q and R since their control register
// settings may be slightly different
#define PQ0 56
#define PQ1 57
#define PQ2 58
#define PQ3 59
#define PR0 60
#define PR1 61


// default 'status' LED on PR1
//static const uint8_t LED_BUILTIN = PR1;
#define LED_BUILTIN PQ3 /* Arduino 1.06 uses #define, not a const uint8_t */
//#define LED_BUILTIN 13 /* this is the arduino Uno default, here for reference */


static const uint8_t A0 = 62;
static const uint8_t A1 = 63;
static const uint8_t A2 = 64;
static const uint8_t A3 = 65;
static const uint8_t A4 = 66;
static const uint8_t A5 = 67;
static const uint8_t A6 = 68;
static const uint8_t A7 = 69;
static const uint8_t A8 = 70;
static const uint8_t A9 = 71;
static const uint8_t A10 = 72;
static const uint8_t A11 = 73;
static const uint8_t A12 = 74;
static const uint8_t A13 = 75;
static const uint8_t A14 = 76;
static const uint8_t A15 = 77;


// on the xmega, all 'pin 2' inputs on any port are asynchronous ints.  Others are 'synchronous' which means
// that they must be held in their 'interrupt state' long enough for the system to detect them.  In any case
// all digital input pins can be use as interrupts, synchronous or otherwise.


#ifdef ARDUINO_MAIN

const uint16_t PROGMEM port_to_mode_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_DIR,       // PA
  (uint16_t) &PORTB_DIR,       // PB
  (uint16_t) &PORTC_DIR,       // PC
  (uint16_t) &PORTD_DIR,       // PD
  (uint16_t) &PORTE_DIR,       // PE
  (uint16_t) &PORTR_DIR,       // PR
  (uint16_t) &PORTF_DIR,       // PF
  (uint16_t) &PORTH_DIR,       // PH
  (uint16_t) &PORTJ_DIR,       // PJ
  (uint16_t) &PORTK_DIR,       // PK
  (uint16_t) &PORTQ_DIR,       // PQ
};

const uint16_t PROGMEM port_to_output_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_OUT,       // PA
  (uint16_t) &PORTB_OUT,       // PB
  (uint16_t) &PORTC_OUT,       // PC
  (uint16_t) &PORTD_OUT,       // PD
  (uint16_t) &PORTE_OUT,       // PE
  (uint16_t) &PORTR_OUT,       // PR
  (uint16_t) &PORTF_OUT,       // PF
  (uint16_t) &PORTH_OUT,       // PH
  (uint16_t) &PORTJ_OUT,       // PJ
  (uint16_t) &PORTK_OUT,       // PK
  (uint16_t) &PORTQ_OUT,       // PQ
};

const uint16_t PROGMEM port_to_input_PGM[] = {
  NOT_A_PORT,                 // 0
  (uint16_t) &PORTA_IN,       // PA
  (uint16_t) &PORTB_IN,       // PB
  (uint16_t) &PORTC_IN,       // PC
  (uint16_t) &PORTD_IN,       // PD
  (uint16_t) &PORTE_IN,       // PE
  (uint16_t) &PORTR_IN,       // PR
  (uint16_t) &PORTF_IN,       // PF
  (uint16_t) &PORTH_IN,       // PH
  (uint16_t) &PORTJ_IN,       // PJ
  (uint16_t) &PORTK_IN,       // PK
  (uint16_t) &PORTQ_IN,       // PQ
};

// xmega has a per-pin config register as well.  Normally these will be 00000111 for analog, 00000000 for digital 'totem pole'
// for 'INPUT_PULLUP' these will be 00011111
//   bits 2:0 (trigger)  000 both edges  001 rising  010 falling  011 level  111 input buffer disabled
//            note:  'input buffer disabled' required to use the 'IN' register (so default here)
//                   also port R does not support 'INTPUT_DISABLED' (sic) so use BOTHEDGES [0] instead
//   bits 5:3 (out/pull) 000 TOTEM [normal], 001 bus keeper [sticky], 010 pulldown, 011 pullup,
//                       100 wired 'or', 101 wired 'and', 110 wired 'or' pulldown, 111 wired 'and' pullup
//   bit 6:  "invert logic" (0 = normal, 1 = inverted)
//   bit 7:  unused, must be zero
// NOTE:  PORTA through PORTQ support 'input buffer disabled' and this setting is recommended
//        for analog inputs.  PORTR apparently does NOT support this (set to zero?)


// PIN DEFINITION ARRAYS - generated using formulas in a spreadsheet

