XMegaForArduino/arduino/variants/RockSolid128A/pins_arduino.h
const uint16_t PROGMEM digital_pin_to_control_PGM[] = {
  (uint16_t) &PORTC_PIN2CTRL,  // PC 2  ** 00 **
  (uint16_t) &PORTC_PIN3CTRL,  // PC 3  ** 01 **
  (uint16_t) &PORTE_PIN5CTRL,  // PE 5  ** 02 **
  (uint16_t) &PORTE_PIN4CTRL,  // PE 4  ** 03 **
  (uint16_t) &PORTE_PIN3CTRL,  // PE 3  ** 04 **
  (uint16_t) &PORTE_PIN2CTRL,  // PE 2  ** 05 **
  (uint16_t) &PORTE_PIN1CTRL,  // PE 1  ** 06 **
  (uint16_t) &PORTE_PIN0CTRL,  // PE 0  ** 07 **
  (uint16_t) &PORTD_PIN5CTRL,  // PD 5  ** 08 **
  (uint16_t) &PORTD_PIN4CTRL,  // PD 4  ** 09 **
  (uint16_t) &PORTC_PIN4CTRL,  // PC 4  ** 10 **
  (uint16_t) &PORTC_PIN5CTRL,  // PC 5  ** 11 **
  (uint16_t) &PORTC_PIN6CTRL,  // PC 6  ** 12 **
  (uint16_t) &PORTC_PIN7CTRL,  // PC 7  ** 13 **
  (uint16_t) &PORTF_PIN3CTRL,  // PF 3  ** 14 **
  (uint16_t) &PORTF_PIN2CTRL,  // PF 2  ** 15 **
  (uint16_t) &PORTE_PIN7CTRL,  // PE 7  ** 16 **
  (uint16_t) &PORTE_PIN6CTRL,  // PE 6  ** 17 **
  (uint16_t) &PORTD_PIN3CTRL,  // PD 3  ** 18 **
  (uint16_t) &PORTD_PIN2CTRL,  // PD 2  ** 19 **
  (uint16_t) &PORTD_PIN0CTRL,  // PD 0  ** 20 **
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1  ** 21 **
  (uint16_t) &PORTJ_PIN0CTRL,  // PJ 0  ** 22 **
  (uint16_t) &PORTJ_PIN1CTRL,  // PJ 1  ** 23 **
  (uint16_t) &PORTJ_PIN2CTRL,  // PJ 2  ** 24 **
  (uint16_t) &PORTJ_PIN3CTRL,  // PJ 3  ** 25 **
  (uint16_t) &PORTJ_PIN4CTRL,  // PJ 4  ** 26 **
  (uint16_t) &PORTJ_PIN5CTRL,  // PJ 5  ** 27 **
  (uint16_t) &PORTJ_PIN6CTRL,  // PJ 6  ** 28 **
  (uint16_t) &PORTJ_PIN7CTRL,  // PJ 7  ** 29 **
  (uint16_t) &PORTK_PIN7CTRL,  // PK 7  ** 30 **
  (uint16_t) &PORTK_PIN6CTRL,  // PK 6  ** 31 **
  (uint16_t) &PORTK_PIN5CTRL,  // PK 5  ** 32 **
  (uint16_t) &PORTK_PIN4CTRL,  // PK 4  ** 33 **
  (uint16_t) &PORTK_PIN3CTRL,  // PK 3  ** 34 **
  (uint16_t) &PORTK_PIN2CTRL,  // PK 2  ** 35 **
  (uint16_t) &PORTK_PIN1CTRL,  // PK 1  ** 36 **
  (uint16_t) &PORTK_PIN0CTRL,  // PK 0  ** 37 **
  (uint16_t) &PORTH_PIN3CTRL,  // PH 3  ** 38 **
  (uint16_t) &PORTH_PIN2CTRL,  // PH 2  ** 39 **
  (uint16_t) &PORTH_PIN1CTRL,  // PH 1  ** 40 **
  (uint16_t) &PORTH_PIN0CTRL,  // PH 0  ** 41 **
  (uint16_t) &PORTH_PIN7CTRL,  // PH 7  ** 42 **
  (uint16_t) &PORTH_PIN6CTRL,  // PH 6  ** 43 **
  (uint16_t) &PORTH_PIN5CTRL,  // PH 5  ** 44 **
  (uint16_t) &PORTH_PIN4CTRL,  // PH 4  ** 45 **
  (uint16_t) &PORTD_PIN7CTRL,  // PD 7  ** 46 **
  (uint16_t) &PORTD_PIN6CTRL,  // PD 6  ** 47 **
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1  ** 48 **
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0  ** 49 **
  (uint16_t) &PORTF_PIN6CTRL,  // PF 6  ** 50 **
  (uint16_t) &PORTF_PIN5CTRL,  // PF 5  ** 51 **
  (uint16_t) &PORTF_PIN7CTRL,  // PF 7  ** 52 **
  (uint16_t) &PORTF_PIN4CTRL,  // PF 4  ** 53 **
  (uint16_t) &PORTF_PIN1CTRL,  // PF 1  ** 54 **
  (uint16_t) &PORTF_PIN0CTRL,  // PF 0  ** 55 **
  (uint16_t) &PORTQ_PIN0CTRL,  // PQ 0  ** 56 **
  (uint16_t) &PORTQ_PIN1CTRL,  // PQ 1  ** 57 **
  (uint16_t) &PORTQ_PIN2CTRL,  // PQ 2  ** 58 **
  (uint16_t) &PORTQ_PIN3CTRL,  // PQ 3  ** 59 **
  (uint16_t) &PORTR_PIN0CTRL,  // PR 0  ** 60 **
  (uint16_t) &PORTR_PIN1CTRL,  // PR 1  ** 61 **
  (uint16_t) &PORTA_PIN0CTRL,  // PA 0  ** 62 **
  (uint16_t) &PORTA_PIN1CTRL,  // PA 1  ** 63 **
  (uint16_t) &PORTA_PIN2CTRL,  // PA 2  ** 64 **
  (uint16_t) &PORTA_PIN3CTRL,  // PA 3  ** 65 **
  (uint16_t) &PORTA_PIN4CTRL,  // PA 4  ** 66 **
  (uint16_t) &PORTA_PIN5CTRL,  // PA 5  ** 67 **
  (uint16_t) &PORTA_PIN6CTRL,  // PA 6  ** 68 **
  (uint16_t) &PORTA_PIN7CTRL,  // PA 7  ** 69 **
  (uint16_t) &PORTB_PIN0CTRL,  // PB 0  ** 70 **
  (uint16_t) &PORTB_PIN1CTRL,  // PB 1  ** 71 **
  (uint16_t) &PORTB_PIN2CTRL,  // PB 2  ** 72 **
  (uint16_t) &PORTB_PIN3CTRL,  // PB 3  ** 73 **
  (uint16_t) &PORTB_PIN4CTRL,  // PB 4  ** 74 **
  (uint16_t) &PORTB_PIN5CTRL,  // PB 5  ** 75 **
  (uint16_t) &PORTB_PIN6CTRL,  // PB 6  ** 76 **
  (uint16_t) &PORTB_PIN7CTRL,  // PB 7  ** 77 **
};

const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
  _PC,    // PC 2  ** 00 **
  _PC,    // PC 3  ** 01 **
  _PE,    // PE 5  ** 02 **
  _PE,    // PE 4  ** 03 **
  _PE,    // PE 3  ** 04 **
  _PE,    // PE 2  ** 05 **
  _PE,    // PE 1  ** 06 **
  _PE,    // PE 0  ** 07 **
  _PD,    // PD 5  ** 08 **
  _PD,    // PD 4  ** 09 **
  _PC,    // PC 4  ** 10 **
  _PC,    // PC 5  ** 11 **
  _PC,    // PC 6  ** 12 **
  _PC,    // PC 7  ** 13 **
  _PF,    // PF 3  ** 14 **
  _PF,    // PF 2  ** 15 **
  _PE,    // PE 7  ** 16 **
  _PE,    // PE 6  ** 17 **
  _PD,    // PD 3  ** 18 **
  _PD,    // PD 2  ** 19 **
  _PD,    // PD 0  ** 20 **
  _PD,    // PD 1  ** 21 **
  _PJ,    // PJ 0  ** 22 **
  _PJ,    // PJ 1  ** 23 **
  _PJ,    // PJ 2  ** 24 **
  _PJ,    // PJ 3  ** 25 **
  _PJ,    // PJ 4  ** 26 **
  _PJ,    // PJ 5  ** 27 **
  _PJ,    // PJ 6  ** 28 **
  _PJ,    // PJ 7  ** 29 **
  _PK,    // PK 7  ** 30 **
  _PK,    // PK 6  ** 31 **
  _PK,    // PK 5  ** 32 **
  _PK,    // PK 4  ** 33 **
  _PK,    // PK 3  ** 34 **
  _PK,    // PK 2  ** 35 **
  _PK,    // PK 1  ** 36 **
  _PK,    // PK 0  ** 37 **
  _PH,    // PH 3  ** 38 **
  _PH,    // PH 2  ** 39 **
  _PH,    // PH 1  ** 40 **
  _PH,    // PH 0  ** 41 **
  _PH,    // PH 7  ** 42 **
  _PH,    // PH 6  ** 43 **
  _PH,    // PH 5  ** 44 **
  _PH,    // PH 4  ** 45 **
  _PD,    // PD 7  ** 46 **
  _PD,    // PD 6  ** 47 **
  _PC,    // PC 1  ** 48 **
  _PC,    // PC 0  ** 49 **
  _PF,    // PF 6  ** 50 **
  _PF,    // PF 5  ** 51 **
  _PF,    // PF 7  ** 52 **
  _PF,    // PF 4  ** 53 **
  _PF,    // PF 1  ** 54 **
  _PF,    // PF 0  ** 55 **
  _PQ,    // PQ 0  ** 56 **
  _PQ,    // PQ 1  ** 57 **
  _PQ,    // PQ 2  ** 58 **
  _PQ,    // PQ 3  ** 59 **
  _PR,    // PR 0  ** 60 **
  _PR,    // PR 1  ** 61 **
  _PA,    // PA 0  ** 62 **
  _PA,    // PA 1  ** 63 **
  _PA,    // PA 2  ** 64 **
  _PA,    // PA 3  ** 65 **
  _PA,    // PA 4  ** 66 **
  _PA,    // PA 5  ** 67 **
  _PA,    // PA 6  ** 68 **
  _PA,    // PA 7  ** 69 **
  _PB,    // PB 0  ** 70 **
  _PB,    // PB 1  ** 71 **
  _PB,    // PB 2  ** 72 **
  _PB,    // PB 3  ** 73 **
  _PB,    // PB 4  ** 74 **
  _PB,    // PB 5  ** 75 **
  _PB,    // PB 6  ** 76 **
  _PB,    // PB 7  ** 77 **
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
  _BV(2),    // PC 2  ** 00 **
  _BV(3),    // PC 3  ** 01 **
  _BV(5),    // PE 5  ** 02 **
  _BV(4),    // PE 4  ** 03 **
  _BV(3),    // PE 3  ** 04 **
  _BV(2),    // PE 2  ** 05 **
  _BV(1),    // PE 1  ** 06 **
  _BV(0),    // PE 0  ** 07 **
  _BV(5),    // PD 5  ** 08 **
  _BV(4),    // PD 4  ** 09 **
  _BV(4),    // PC 4  ** 10 **
  _BV(5),    // PC 5  ** 11 **
  _BV(6),    // PC 6  ** 12 **
  _BV(7),    // PC 7  ** 13 **
  _BV(3),    // PF 3  ** 14 **
  _BV(2),    // PF 2  ** 15 **
  _BV(7),    // PE 7  ** 16 **
  _BV(6),    // PE 6  ** 17 **
  _BV(3),    // PD 3  ** 18 **
  _BV(2),    // PD 2  ** 19 **
  _BV(0),    // PD 0  ** 20 **
  _BV(1),    // PD 1  ** 21 **
  _BV(0),    // PJ 0  ** 22 **
  _BV(1),    // PJ 1  ** 23 **
  _BV(2),    // PJ 2  ** 24 **
  _BV(3),    // PJ 3  ** 25 **
  _BV(4),    // PJ 4  ** 26 **
  _BV(5),    // PJ 5  ** 27 **
  _BV(6),    // PJ 6  ** 28 **
  _BV(7),    // PJ 7  ** 29 **
  _BV(7),    // PK 7  ** 30 **
  _BV(6),    // PK 6  ** 31 **
  _BV(5),    // PK 5  ** 32 **
  _BV(4),    // PK 4  ** 33 **
  _BV(3),    // PK 3  ** 34 **
  _BV(2),    // PK 2  ** 35 **
  _BV(1),    // PK 1  ** 36 **
  _BV(0),    // PK 0  ** 37 **
  _BV(3),    // PH 3  ** 38 **
  _BV(2),    // PH 2  ** 39 **
  _BV(1),    // PH 1  ** 40 **
  _BV(0),    // PH 0  ** 41 **
  _BV(7),    // PH 7  ** 42 **
  _BV(6),    // PH 6  ** 43 **
  _BV(5),    // PH 5  ** 44 **
  _BV(4),    // PH 4  ** 45 **
  _BV(7),    // PD 7  ** 46 **
  _BV(6),    // PD 6  ** 47 **
  _BV(1),    // PC 1  ** 48 **
  _BV(0),    // PC 0  ** 49 **
  _BV(6),    // PF 6  ** 50 **
  _BV(5),    // PF 5  ** 51 **
  _BV(7),    // PF 7  ** 52 **
  _BV(4),    // PF 4  ** 53 **
  _BV(1),    // PF 1  ** 54 **
  _BV(0),    // PF 0  ** 55 **
  _BV(0),    // PQ 0  ** 56 **
  _BV(1),    // PQ 1  ** 57 **
  _BV(2),    // PQ 2  ** 58 **
  _BV(3),    // PQ 3  ** 59 **
  _BV(0),    // PR 0  ** 60 **
  _BV(1),    // PR 1  ** 61 **
  _BV(0),    // PA 0  ** 62 **
  _BV(1),    // PA 1  ** 63 **
  _BV(2),    // PA 2  ** 64 **
  _BV(3),    // PA 3  ** 65 **
  _BV(4),    // PA 4  ** 66 **
  _BV(5),    // PA 5  ** 67 **
  _BV(6),    // PA 6  ** 68 **
  _BV(7),    // PA 7  ** 69 **
  _BV(0),    // PB 0  ** 70 **
  _BV(1),    // PB 1  ** 71 **
  _BV(2),    // PB 2  ** 72 **
  _BV(3),    // PB 3  ** 73 **
  _BV(4),    // PB 4  ** 74 **
  _BV(5),    // PB 5  ** 75 **
  _BV(6),    // PB 6  ** 76 **
  _BV(7),    // PB 7  ** 77 **
};

const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  TIMERC2,         // PC 2  ** 00 **
  TIMERC2,         // PC 3  ** 01 **
  TIMERE2,         // PE 5  ** 02 **
  TIMERE2,         // PE 4  ** 03 **
  TIMERE2,         // PE 3  ** 04 **
  TIMERE2,         // PE 2  ** 05 **
  TIMERE2,         // PE 1  ** 06 **
  TIMERE2,         // PE 0  ** 07 **
  TIMERD2,         // PD 5  ** 08 **
  TIMERD2,         // PD 4  ** 09 **
  TIMERC2,         // PC 4  ** 10 **
  TIMERC2,         // PC 5  ** 11 **
  TIMERC2,         // PC 6  ** 12 **
  TIMERC2,         // PC 7  ** 13 **
  TIMERF2,         // PF 3  ** 14 **
  TIMERF2,         // PF 2  ** 15 **
  TIMERE2,         // PE 7  ** 16 **
  TIMERE2,         // PE 6  ** 17 **
  TIMERD2,         // PD 3  ** 18 **
  TIMERD2,         // PD 2  ** 19 **
  TIMERD2,         // PD 0  ** 20 **
  TIMERD2,         // PD 1  ** 21 **
  NOT_ON_TIMER,    // PJ 0  ** 22 **
  NOT_ON_TIMER,    // PJ 1  ** 23 **
  NOT_ON_TIMER,    // PJ 2  ** 24 **
  NOT_ON_TIMER,    // PJ 3  ** 25 **
  NOT_ON_TIMER,    // PJ 4  ** 26 **
  NOT_ON_TIMER,    // PJ 5  ** 27 **
  NOT_ON_TIMER,    // PJ 6  ** 28 **
  NOT_ON_TIMER,    // PJ 7  ** 29 **
  NOT_ON_TIMER,    // PK 7  ** 30 **
  NOT_ON_TIMER,    // PK 6  ** 31 **
  NOT_ON_TIMER,    // PK 5  ** 32 **
  NOT_ON_TIMER,    // PK 4  ** 33 **
  NOT_ON_TIMER,    // PK 3  ** 34 **
  NOT_ON_TIMER,    // PK 2  ** 35 **
  NOT_ON_TIMER,    // PK 1  ** 36 **
  NOT_ON_TIMER,    // PK 0  ** 37 **
  NOT_ON_TIMER,    // PH 3  ** 38 **
  NOT_ON_TIMER,    // PH 2  ** 39 **
  NOT_ON_TIMER,    // PH 1  ** 40 **
  NOT_ON_TIMER,    // PH 0  ** 41 **
  NOT_ON_TIMER,    // PH 7  ** 42 **
  NOT_ON_TIMER,    // PH 6  ** 43 **
  NOT_ON_TIMER,    // PH 5  ** 44 **
  NOT_ON_TIMER,    // PH 4  ** 45 **
  TIMERD2,         // PD 7  ** 46 **
  TIMERD2,         // PD 6  ** 47 **
  TIMERC2,         // PC 1  ** 48 **
  TIMERC2,         // PC 0  ** 49 **
  TIMERF2,         // PF 6  ** 50 **
  TIMERF2,         // PF 5  ** 51 **
  TIMERF2,         // PF 7  ** 52 **
  TIMERF2,         // PF 4  ** 53 **
  TIMERF2,         // PF 1  ** 54 **
  TIMERF2,         // PF 0  ** 55 **
  NOT_ON_TIMER,    // PQ 0  ** 56 **
  NOT_ON_TIMER,    // PQ 1  ** 57 **
  NOT_ON_TIMER,    // PQ 2  ** 58 **
  NOT_ON_TIMER,    // PQ 3  ** 59 **
  NOT_ON_TIMER,    // PR 0  ** 60 **
  NOT_ON_TIMER,    // PR 1  ** 61 **
  NOT_ON_TIMER,    // PA 0  ** 62 **
  NOT_ON_TIMER,    // PA 1  ** 63 **
  NOT_ON_TIMER,    // PA 2  ** 64 **
  NOT_ON_TIMER,    // PA 3  ** 65 **
  NOT_ON_TIMER,    // PA 4  ** 66 **
  NOT_ON_TIMER,    // PA 5  ** 67 **
  NOT_ON_TIMER,    // PA 6  ** 68 **
  NOT_ON_TIMER,    // PA 7  ** 69 **
  NOT_ON_TIMER,    // PB 0  ** 70 **
  NOT_ON_TIMER,    // PB 1  ** 71 **
  NOT_ON_TIMER,    // PB 2  ** 72 **
  NOT_ON_TIMER,    // PB 3  ** 73 **
  NOT_ON_TIMER,    // PB 4  ** 74 **
  NOT_ON_TIMER,    // PB 5  ** 75 **
  NOT_ON_TIMER,    // PB 6  ** 76 **
  NOT_ON_TIMER,    // PB 7  ** 77 **
};

#endif // ARDUINO_MAIN


// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR   Serial
#define SERIAL_PORT_HARDWARE  Serial
#define SERIAL_HARDWARE_OPEN  Serial2

#endif // Pins_Arduino_h



